# **Pandas 02**
Source : [Indonesia Belajar](https://www.youtube.com/watch?v=I_UeEB0Bj-I)

# **#05 Membalik Urutan Baris dan Kolom pada Data Frame**

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.1
1.24.2

Persiapan Data Frame

In [2]:
# Mengimpor library pandas untuk manipulasi data frame
import pandas as pd

# Mengimpor library numpy untuk menghasilkan bilangan acak
import numpy as np

# Menentukan jumlah baris, kolom, dan label kolom untuk data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

# Membuat data frame dengan nilai acak antara 1 dan 10
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)

# Menampilkan data frame yang telah dibuat
df

   A  B  C  D  E
0  2  7  4  4  6
1  4  5  4  8  9
2  1  1  1  3  4
3  6  8  6  8  6
4  7  3  2  9  8

Membalik Urutan Kolom

In [3]:
# Menggunakan lokasi (loc) untuk memilih semua baris dan kolom dalam data frame dengan urutan kolom terbalik
df.loc[:, ::-1]

   E  D  C  B  A
0  6  4  4  7  2
1  9  8  4  5  4
2  4  3  1  1  1
3  6  8  6  8  6
4  8  9  2  3  7

Membalik Urutan Baris

In [4]:
# Menggunakan lokasi (loc) untuk memilih semua baris dalam data frame dengan urutan baris terbalik
df.loc[::-1]

   A  B  C  D  E
4  7  3  2  9  8
3  6  8  6  8  6
2  1  1  1  3  4
1  4  5  4  8  9
0  2  7  4  4  6

Membalik Urutan Baris dan Melakukan Penyesuaian Ulang Index

In [5]:
# Menggunakan lokasi (loc) untuk memilih semua baris dalam data frame dengan urutan baris terbalik,
# kemudian mereset indeks agar indeks baru diatur secara berurutan
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  7  3  2  9  8
1  6  8  6  8  6
2  1  1  1  3  4
3  4  5  4  8  9
4  2  7  4  4  6

# **#06 Mengganti Nama (label) Kolom pada Data Frame**

Import Modules

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.1
1.24.2

Persiapan Data Frame

In [7]:
# Mengimpor library pandas untuk manipulasi data frame
import pandas as pd

# Mengimpor library numpy untuk menghasilkan bilangan acak
import numpy as np

# Menentukan jumlah baris, kolom, dan label kolom untuk data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

# Membuat data frame dengan nilai acak antara 1 dan 10
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)

# Menampilkan data frame yang telah dibuat
df

   A  B  C  D  E
0  1  5  2  5  8
1  6  1  5  2  7
2  5  6  8  2  5
3  3  1  3  9  8
4  2  5  2  3  1

Mengganti Nama (label) Untuk Sebuah Kolom pada Data Frame

In [8]:
# Menggunakan metode rename untuk mengganti nama kolom 'C' menjadi 'Hobi' dalam data frame
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  1  5     2  5  8
1  6  1     5  2  7
2  5  6     8  2  5
3  3  1     3  9  8
4  2  5     2  3  1

Mengganti Nama (label) Untuk Banyak Kolom pada Data Frame

In [9]:
# Menggunakan metode rename untuk mengganti beberapa nama kolom dalam data frame
# Kolom 'A' diganti menjadi 'Nama', 'B' diganti menjadi 'Alamat', dan 'D' diganti menjadi 'Kota'
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     1       5  2     5  8
1     6       1  5     2  7
2     5       6  8     2  5
3     3       1  3     9  8
4     2       5  2     3  1

# **#07 Menghapus (drop) Missing Values (NaN) pada Data Frame**

Persiapan Data Frame

In [10]:
# Mengimpor library pandas untuk manipulasi data frame
import pandas as pd
import numpy as np

# Membuat data frame dengan nilai acak menggunakan library numpy
data = {'Z' : np.random.rand(10), 'A': np.random.rand(10), 'B':np.random.rand(10),'C':np.random.rand(10),'D':np.random.rand(10)}
df = pd.DataFrame(data)

# Mengatur beberapa nilai menjadi NaN (Not a Number) dalam data frame menggunakan indeks dan kolom
df.iloc[2:5, 0] = np.nan
df.iloc[7, 2] = np.nan

# Menampilkan lima data awal dari data frame
df.head()

          Z         A         B         C         D
0  0.472390  0.209979  0.455131  0.039418  0.051076
1  0.389643  0.496957  0.517790  0.744205  0.025654
2       NaN  0.135422  0.835897  0.082390  0.953894
3       NaN  0.546907  0.158914  0.282353  0.379002
4       NaN  0.092161  0.960146  0.373831  0.374064

In [11]:
# Menggunakan metode rename untuk mengganti nama indeks dari 'index' menjadi 'Z' dalam data frame
df = df.rename(columns={'index':'Z'})

# Menampilkan lima data awal dari data frame setelah perubahan nama indeks
df.head()

          Z         A         B         C         D
0  0.472390  0.209979  0.455131  0.039418  0.051076
1  0.389643  0.496957  0.517790  0.744205  0.025654
2       NaN  0.135422  0.835897  0.082390  0.953894
3       NaN  0.546907  0.158914  0.282353  0.379002
4       NaN  0.092161  0.960146  0.373831  0.374064

In [12]:
# Membuat salinan mendalam (deep copy) dari data frame df dan menyimpannya dalam variabel df_backup
df_backup = df.copy(deep=True)

Menghapus (drop) Setiap Kolom yang Mengandung Missing Values

In [13]:
# Menggunakan metode dropna untuk menghapus kolom-kolom yang mengandung nilai NaN (Not a Number) dari data frame
# Parameter axis='columns' digunakan untuk menghapus kolom, sedangkan axis='rows' dapat digunakan untuk menghapus baris
df = df.dropna(axis='columns')

# Menampilkan lima data awal dari data frame setelah penghapusan kolom dengan nilai NaN
df.head()

          A         C         D
0  0.209979  0.039418  0.051076
1  0.496957  0.744205  0.025654
2  0.135422  0.082390  0.953894
3  0.546907  0.282353  0.379002
4  0.092161  0.373831  0.374064

Menghapus (drop) Setiap Baris yang Mengandung Missing Values

In [14]:
# Membuat salinan mendalam (deep copy) dari data frame df_backup dan menyimpannya dalam variabel df
df = df_backup.copy(deep=True)

# Menggunakan metode dropna untuk menghapus baris-baris yang mengandung nilai NaN (Not a Number) dari data frame
# Parameter axis='rows' digunakan untuk menghapus baris, sedangkan axis='columns' dapat digunakan untuk menghapus kolom
df = df.dropna(axis='rows')

# Menampilkan lima data awal dari data frame setelah penghapusan baris dengan nilai NaN
df.head()

          Z         A         B         C         D
0  0.472390  0.209979  0.455131  0.039418  0.051076
1  0.389643  0.496957  0.517790  0.744205  0.025654
5  0.091434  0.230385  0.972670  0.481135  0.932963
6  0.056870  0.852126  0.854811  0.961489  0.687177
8  0.131668  0.682354  0.544164  0.681604  0.849975

Persentase missing values untuk tiap kolom

In [15]:
# Membuat salinan mendalam (deep copy) dari data frame df_backup dan menyimpannya dalam variabel df
df = df_backup.copy(deep=True)

# Menggunakan metode isna() untuk mendeteksi nilai NaN (Not a Number) dalam data frame
# Metode mean() digunakan untuk menghitung proporsi nilai NaN pada setiap kolom
# Mengalikan dengan 100 untuk mendapatkan persentase nilai NaN dalam setiap kolom
df.isna().mean() * 100

Z    30.0
A     0.0
B    10.0
C     0.0
D     0.0
dtype: float64

Menghapus (drop) Setiap Kolom yang Mengandung Missing Values Berdasarkan Threshold (ambang batas)

In [16]:
# Menetapkan nilai ambang batas (threshold) sebagai 90% dari jumlah baris dalam data frame
threshold = len(df) * 0.9

# Menggunakan metode dropna untuk menghapus kolom-kolom yang memiliki persentase nilai NaN melebihi threshold
# Parameter thresh digunakan untuk menetapkan ambang batas persentase nilai NaN yang diizinkan dalam kolom
# Parameter axis='columns' digunakan untuk menghapus kolom, sedangkan axis='rows' dapat digunakan untuk menghapus baris
df = df.dropna(thresh=threshold, axis='columns')

# Menampilkan lima data awal dari data frame setelah penghapusan kolom dengan nilai NaN
df.head()

          A         B         C         D
0  0.209979  0.455131  0.039418  0.051076
1  0.496957  0.517790  0.744205  0.025654
2  0.135422  0.835897  0.082390  0.953894
3  0.546907  0.158914  0.282353  0.379002
4  0.092161  0.960146  0.373831  0.374064

# **#08 Memeriksa Kesamaan Antar Dua Buah Kolom (Series) pada Data Frame**

Import Modules

In [17]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.1
1.24.2

Persiapan Data Frame

In [18]:
# Membuat data frame dengan menggunakan dictionary sebagai sumber datanya
# Data frame memiliki dua kolom, 'A' dan 'B', dengan beberapa nilai NaN (Not a Number)
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)

# Menampilkan data frame yang telah dibuat
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

Mengenal Pandas Series
- Series adalah struktur data lain yang dimiliki pandas dengan objek 1-dimensi yang berisi sequence nilai dan berasosiasi dengan label data, yang disebut indeks.
- Untuk membuat sebuah Series atau kolom, kita bisa membuatnya dari sebuah array dengan memanggil fungsi Series pada pandas.

In [19]:
# Menggunakan indeksing untuk memilih kolom 'A' dari data frame
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [20]:
# Menggunakan fungsi type untuk mengetahui tipe objek dari kolom 'A' dalam data frame
type(df['A'])

pandas.core.series.Series

In [21]:
# Menggunakan fungsi type untuk mengetahui tipe objek dari data frame
type(df)

pandas.core.frame.DataFrame

Memeriksa Kesamaan dengan Operator ==

In [22]:
# Menggunakan operator == untuk membandingkan nilai antara kolom 'A' dan 'B' dalam data frame
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

Memeriksa kesamaan dengan method equals()

In [23]:
# Menggunakan metode equals untuk memeriksa apakah isi dari kolom 'A' dan 'B' dalam data frame identik
# Metode ini dapat menangani perbandingan nilai NaN dengan benar
df['A'].equals(df['B'])

True

Memeriksa Kesamaan Antar Dua Data Frame

In [24]:
# Membuat salinan mendalam (deep copy) dari data frame df dan menyimpannya dalam variabel df1
df1 = df.copy(deep=True)

# Menggunakan metode equals untuk memeriksa apakah isi dari df dan df1 identik
# Metode ini dapat menangani perbandingan nilai NaN dengan benar
df.equals(df1)

True

In [25]:
# Menggunakan operator == untuk membandingkan nilai antara setiap elemen dalam df dan df1
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True